requests/multiroom.xml

<ns0:Envelope xmlns:ns0="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns1="http://www.deltasolutions.ru/om/rt/LyraOmsService/">
    <ns0:Header />
    <ns0:Body>
        <ns1:SubmitOrderRequest>
            <Components>
                
                <Component>
                    <Attributes>
						<Attribute>
                            <Name>cfs_spec_id</Name>
                            <Value>multiroom</Value>
                        </Attribute>
                        <Attribute>
                            <Name>department_id</Name>
                            <Value>11</Value>
                        </Attribute>
                        <Attribute>
                            <Name>city</Name>
                            <Value>26131</Value>
                        </Attribute>
                        <Attribute>
                            <Name>street</Name>
                            <Value>606</Value>
                        </Attribute>
                        <Attribute>
                            <Name>house</Name>
                            <Value>48</Value>
                        </Attribute>
                        <Attribute>
                            <Name>building</Name>
                            <Value>2</Value>
                        </Attribute>
                        <Attribute>
                            <Name>flat</Name>
                            <Value>129</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_name</Name>
                            <Value>М КРОФТ СЕМЕН ИЛЬИЧ</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_type</Name>
                            <Value>3</Value>
                        </Attribute>
                        <Attribute>
                            <Name>client_id</Name>
                            <Value>32535243</Value>
                        </Attribute>
                        <Attribute>
                            <Name>rtpl_id</Name>
                            <Value>36179</Value>
                        </Attribute>
                        <Attribute>
                            <Name>prcl_id</Name>
                            <Value>160280</Value>
                        </Attribute>
                        <Attribute>
                            <Name>srls_quant</Name>
                            <Value>1</Value>
                        </Attribute>
						<Attribute>
                            <Name>subscriber_id</Name>
                            <Value>2345</Value>
                        </Attribute>
                        <Attribute>
                            <Name>virtual_number</Name>
                            <Value>799999999211</Value>
                        </Attribute>
                        <Attribute>
                            <Name>nri_rnabn</Name>
                            <Value>11081141</Value>
                        </Attribute>
                        <Attribute>
                            <Name>connection_scheme</Name>
                            <Value>187</Value>
                        </Attribute>
                        <Attribute>
                            <Name>technology</Name>
                            <Value>xPON</Value>
                        </Attribute>
                        <Attribute>
                            <Name>password</Name>
                            <Value>999999999998</Value>
                        </Attribute>
                        <Attribute>
                            <Name>action_code</Name>
                            <Value>1</Value>
                        </Attribute>
                        <Attribute>
                            <Name>contract_id</Name>
                            <Value>2215008</Value>
                        </Attribute>
                        <Attribute>
                            <Name>service_reciever</Name>
                            <Value>2</Value>
                        </Attribute>
                        <Attribute>
                            <Name>lyra_const_service_id</Name>
                            <Value>160280</Value>
                        </Attribute>
                        <Attribute>
                            <Name>lyra_one_time_service_id</Name>
                            <Value>1</Value>
                        </Attribute>
                        <Attribute>
                            <Name>instance_id</Name>
                            <Value>1777</Value>
                        </Attribute>
                        <Attribute>
                            <Name>installation_order_id</Name>
                            <Value>178</Value>
                        </Attribute>
                        <Attribute>
                            <Name>cpe_hw_address</Name>
                            <Value>98765af45566</Value>
                        </Attribute>
                        <Attribute>
                            <Name>tx_id</Name>
                            <Value>1019</Value>
                        </Attribute>
                        <Attribute>
                            <Name>installation_date</Name>
                            <Value>2015-11-11T00:00:00+06:00</Value>
                        </Attribute>
                        <Attribute>
                            <Name>installation_interval</Name>
                            <Value>10:00-12:00</Value>
                        </Attribute>
                        <Attribute>
                            <Name>need_installation</Name>
                            <Value>1</Value>
                        </Attribute>
						<Attribute>
                            <Name>client_birth_date</Name>
                            <Value>2015-07-03T00:00:00+06:00</Value>
                        </Attribute>
						<Attribute>
                            <Name>client_birth_place</Name>
                            <Value>г. Пермь</Value>
                        </Attribute>
						<Attribute>
                            <Name>client_pass_date</Name>
                            <Value>2015-07-03T00:00:00+06:00</Value>
                        </Attribute>
						<Attribute>
                            <Name>client_pass_num</Name>
                            <Value>638221</Value>
                        </Attribute>
						<Attribute>
                            <Name>client_pass_place</Name>
                            <Value>ОРДЖОН-М РОВД ГОР ПЕРМИ</Value>
                        </Attribute>
						<Attribute>
                            <Name>client_pass_ser</Name>
                            <Value>5703</Value>
                        </Attribute>
						<Attribute>
                            <Name>client_phone</Name>
                            <Value>143420932354</Value>
                        </Attribute>
						<Attribute>
                            <Name>zip</Name>
                            <Value>614104</Value>
                        </Attribute>
						<Attribute>
                            <Name>delivery_date</Name>
                            <Value>2015-07-03T00:00:00+06:00</Value>
                        </Attribute>
                    <Attribute>
                            <Name>order_start_date</Name>
                            <Value>2015-07-03T00:00:00+06:00</Value>
                        </Attribute>
                        <Attribute>
                            <Name>order_action_type</Name>
                            <Value>PR</Value>
                        </Attribute>
                        <Attribute>
                            <Name>service_receiver</Name>
                            <Value>2</Value>
                        </Attribute>
                        <Attribute>
                            <Name>pack_id</Name>
                            <Value>26900</Value>
                        </Attribute>
                        <Attribute>
                            <Name>main_connection_scheme</Name>
                            <Value>171</Value>
                        </Attribute>
						<Attribute>
                            <Name>parent_virtual_number</Name>
                            <Value>799999999210</Value>
                        </Attribute>
						<Attribute>
                            <Name>subs_eak_id</Name>
                            <Value>171</Value>
                        </Attribute>
                        </Attributes>
                </Component>
            </Components>
            <CommonData>
                <Attributes>
                    <Attribute>
                        <Name>main_virtual_number</Name>
                        <Value>11194</Value>
                    </Attribute>
                </Attributes>   
            </CommonData>
        </ns1:SubmitOrderRequest>
    </ns0:Body>
</ns0:Envelope>